# 데이터프레임

#### 데이터프레임 - 판다스에서 가장 기본적인 데이터 형식
#### 여러개의 시리즈 객체로 구성되어 있음. 한 행은 하나의 index가 할당됨

In [1]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn
np.random.seed(101)

## 1. 데이터프레임 만들기

### (1) 데이터 프레임 만들기

In [7]:
# 5행 4열의 임의의 수를 생성하여 데이터프레임 생성.
df = pd.DataFrame(randn(5, 4), index='A B C D E'.split(), columns = 'W X Y Z'.split())

In [8]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## 2. 데이터 접근하기

### (2) 데이터 접근과 인덱싱

In [10]:
#컬럼명을 지정하여 한 컬럼의 데이터를 얻는다.
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [11]:
# 여러개의 컬럼 지정 - 컬럼명을 리스트로 전달
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [12]:
# 컬럼 지정시 .(dot operator) 사용 가능(많이 사용하지는 않음.)
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [13]:
# 데이터 프레임의 컬럼은 시리즈 형태이다.
type(df['W'])

pandas.core.series.Series

### (3) 데이터프레임에 새로운 컬럼 추가

In [14]:
#데이터프레임에 새로운 컬럼명을 지정하여 생성
df['new'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

### (4) 데이터프레임에서 컬럼 삭제

In [16]:
# axis = 0 행 단위, axis = 1 열 단위
df.drop('new', axis = 1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [17]:
# 데이터프레임에서 drop()을 수행해도 원본 데이터에는 영향을 주지 않는다.
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [18]:
# 원본데이터 수정하기 위한 속성 : inplace
# inplace = True이면 원본 데이터에 수정이 반영됨
df.drop('new', axis = 1, inplace=True)

In [19]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### (5) 행 삭제

In [20]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [21]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
df.drop('E', axis = 0, inplace = True)

In [23]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

### (6) 행 접근하기

In [25]:
# 인덱스 사용하여 행 접근: loc()
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [27]:
# 고유의 숫자 인덱스를 사용하여 행 접근 : iloc()
# 숫자 인덱스는 0부터 시작
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

### (7) 데이터프레임의 부분집합

In [28]:
df.loc['B','Y']

0.16690463609281317

In [29]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

## 3. 조건적 데이터 선택

In [31]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [32]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True

In [34]:
# 데이터프레임에서 0보다 큰 값만 추출
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752

In [35]:
# 컬럼에 조건 설정하여 데이터 추출
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [36]:
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [39]:
# 조건 설정후 여러개의 컬럼을 추출
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [40]:
# 논리 연산자를 사용 가능 ($, |)
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## 4. 인덱스 관련 기능

### 기본적으로 인덱스 값을 0, 1, 2, 3, .....n으로 다시 설정하는 기능 - reset_index()

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752

In [46]:
newind = 'AB CD EF GH'.split()

In [48]:
df['new_col'] = newind
df

          W         X         Y         Z new_col
A  0.302665  1.693723 -1.706086 -1.159119      AB
B -0.134841  0.390528  0.166905  0.184502      CD
C  0.807706  0.072960  0.638787  0.329646      EF
D -0.497104 -0.754070 -0.943406  0.484752      GH

In [49]:
# 새로운 컬럼으로 인덱스 설정
df.set_index('new_col')

                W         X         Y         Z
new_col
AB       0.302665  1.693723 -1.706086 -1.159119
CD      -0.134841  0.390528  0.166905  0.184502
EF       0.807706  0.072960  0.638787  0.329646
GH      -0.497104 -0.754070 -0.943406  0.484752

In [50]:
df

          W         X         Y         Z new_col
A  0.302665  1.693723 -1.706086 -1.159119      AB
B -0.134841  0.390528  0.166905  0.184502      CD
C  0.807706  0.072960  0.638787  0.329646      EF
D -0.497104 -0.754070 -0.943406  0.484752      GH

In [51]:
# 원본 데이터에 set_index()를 반영하려면 inplace = True
df.set_index('new_col', inplace=True)

In [52]:
df

                W         X         Y         Z
new_col
AB       0.302665  1.693723 -1.706086 -1.159119
CD      -0.134841  0.390528  0.166905  0.184502
EF       0.807706  0.072960  0.638787  0.329646
GH      -0.497104 -0.754070 -0.943406  0.484752

## 5.인덱스의 값이 여러 개인 경우, 계층적인 인덱스

In [54]:
# 인덱스 레이블 선언
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [56]:
df = pd.DataFrame(np.random.rand(6,2), index=hier_index, columns=['A', 'B'])
df

             A         B
G1 1  0.043397  0.223937
   2  0.575205  0.120434
   3  0.500117  0.138010
G2 1  0.052808  0.178277
   2  0.442368  0.877587
   3  0.949264  0.478167

In [57]:
# 계층적인 인덱스를 가진 데이터프레임의 접근
df.loc['G1']

          A         B
1  0.043397  0.223937
2  0.575205  0.120434
3  0.500117  0.138010

In [58]:
#
df.loc['G1'].loc[1]

A    0.043397
B    0.223937
Name: 1, dtype: float64

In [59]:
df.index.names

FrozenList([None, None])

In [60]:
# 인덱스에 구분자를 추가
df.index.names = ['Group', 'Num']

In [61]:
df

                  A         B
Group Num
G1    1    0.043397  0.223937
      2    0.575205  0.120434
      3    0.500117  0.138010
G2    1    0.052808  0.178277
      2    0.442368  0.877587
      3    0.949264  0.478167

In [63]:
# 하위 레벨 지정하여 멀티 인덱스 데이터 추출
df.xs('G1')

            A         B
Num
1    0.043397  0.223937
2    0.575205  0.120434
3    0.500117  0.138010

In [65]:
df.xs(('G1',1))

A    0.043397
B    0.223937
Name: (G1, 1), dtype: float64

In [67]:
# 행 숫자로 데이터 가져오기
df.xs(1, level='Num')

              A         B
Group
G1     0.043397  0.223937
G2     0.052808  0.178277